app/Controllers/Client/AuthController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function dashboard()
    {
        $client = $this->clientsModel->find(session()->get('client_id'));