app/Controllers/Client/ClientsController.php

    public function dashboard()
    {
        $client = $this->clientsModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

    public function showDepotForm()
    {
        $client = $this->clientsModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1

    public function depot()
    {
        $montant = $this->request->getPost('montant');
        $clientId = session()->get('client_id');

        // Validation : montant requis, numérique, supérieur à 0
        if (empty($montant) || !is_numeric($montant) || $montant <= 0) {
            return redirect()->back()->withInput()->with('error', 'Veuillez saisir un montant valide supérieur à 0.');
        }

        $montant = $montant;

        // Calcul des frais via le barème opérateur
        $frais = $this->trancheModel->getFrais($this->typeOperationDepot, $montant);

        // Récupérer le solde actuel
        $client = $this->clientsModel->find($clientId);
        $solde  = $client['solde'];

        // Si le solde couvre les frais → frais payés depuis le solde, montant credited intégralement
        // Si le solde ne couvre pas les frais → le manque est déduit du dépôt
        $nouveauSolde = $solde + $montant - $frais;

        $this->clientsModel->update($clientId, ['solde' => $nouveauSolde]);

        // Enregistrer la transaction
        $this->transactionsModel->insert([
            'client_id'         => $clientId,
            'destinataire_id'   => null,
            'type_operation_id' => $this->typeOperationDepot,
            'montant'           => $montant,
            'frais'             => $frais,
        ]);
---
UPDATE `clients` SET `solde` = 19800
WHERE `clients`.`id` IN (2)
INSERT INTO `transactions` (`client_id`, `destinataire_id`, `type_operation_id`, `montant`, `frais`) VALUES (2, NULL, 1, '10000', 100)

    public function showRetraitForm()
    {
        $client = $this->clientsModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

    public function showTransfertForm()
    {
        $client  = $this->clientsModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1

    public function detecterOperateur()
    {
        $telephone = preg_replace('/\s+/', '', trim($this->request->getGet('tel') ?? ''));
        $clientId  = session()->get('client_id');

        if (strlen($telephone) < 3) {
            return $this->response->setJSON(['operateur_id' => null, 'est_nous' => false, 'nom' => '']);
        }

        $operateurId = $this->prefixesModel->getOperateurIdByTelephone($telephone);
        $emetteur    = $this->clientsModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1