app/Controllers/Client/EpargneController.php

    public function index()
    {
        $client = $this->clientsModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1