app/Controllers/Client/TransfertController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 3
---
    public function detecterOperateur()
    {
        $telephone = preg_replace('/\s+/', '', trim($this->request->getGet('tel') ?? ''));
        $clientId  = session()->get('client_id');

        if (strlen($telephone) < 3) {
            return $this->response->setJSON(['operateur_id' => null, 'est_nous' => false, 'nom' => '']);
        }

        $operateurId = $this->prefixesModel->getOperateurIdByTelephone($telephone);
        $emetteur    = $this->clientsModel->find($clientId);
        $emetteurOp  = $this->prefixesModel->getOperateurIdByTelephone($emetteur['telephone']);

        $estNous = ($operateurId !== null && $emetteurOp !== null && $operateurId === $emetteurOp);

        $nom = '';
        if ($operateurId !== null) {
            $op = $this->operateurModel->find($operateurId);