app/Models/Client/ClientsModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0337172780'
 LIMIT 1
---
    public function findByTelephone($telephone)
    {
        return $this->where('telephone', $telephone)->first();