app/Models/Client/EpargneModel.php

SELECT *
FROM `epargne`
WHERE `client_id` = 1
 LIMIT 1
---
    public function getEpargneByClient($client_id)
    {
        return $this->where('client_id', $client_id)->first();