app/Controllers/Operateur/ClientController.php

    public function detail(int $id)
    {
        $client = $this->clientModel->find($id);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1