app/Controllers/Operateur/DashboardController.php

    public function index()
    {
        $clientModel      = new ClientModel();
        $transactionModel = new TransactionModel();
        $prefixeModel     = new PrefixeModel();

        $nbClients       = $clientModel->countAllResults(false);
        $nbTransactions  = $transactionModel->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `transactions`