app/Controllers/Operateur/PrefixeController.php

    public function index()
    {
        $data = [
            'prefixes' => $this->prefixeModel->findAll(),
        ];
---
SELECT *
FROM `prefixes`