app/Models/Operateur/ClientModel.php

SELECT `c`.*, COUNT(t.id) AS nb_transactions
FROM `clients` `c`
LEFT JOIN `transactions` `t` ON `t`.`client_id` = `c`.`id`
GROUP BY `c`.`id`
ORDER BY `c`.`date_creation` DESC
---
    public function getAllWithStats(): array
    {
        return $this->db->table('clients c')
            ->select('c.*, COUNT(t.id) AS nb_transactions')
            ->join('transactions t', 't.client_id = c.id', 'left')
            ->groupBy('c.id')
            ->orderBy('c.date_creation', 'DESC')
            ->get()
            ->getResultArray();