app/Models/Operateur/PrefixeModel.php

    public function getNosPrefixes()
    {
        return $this->select('prefixes.*, operateurs.nom as operateur_nom')
            ->join('operateurs', 'operateurs.id = prefixes.operateur_id')
            ->where('operateurs.est_nous', 1)
            ->orderBy('prefixes.prefixe', 'ASC')
            ->findAll();
---
SELECT `prefixes`.*, `operateurs`.`nom` as `operateur_nom`
FROM `prefixes`
JOIN `operateurs` ON `operateurs`.`id` = `prefixes`.`operateur_id`
WHERE `operateurs`.`est_nous` = 1
ORDER BY `prefixes`.`prefixe` ASC

    public function getAutresPrefixes()
    {
        return $this->select('prefixes.*, operateurs.nom as operateur_nom')
            ->join('operateurs', 'operateurs.id = prefixes.operateur_id')
            ->where('operateurs.est_nous', 0)
            ->orderBy('operateurs.nom', 'ASC')
            ->orderBy('prefixes.prefixe', 'ASC')
            ->findAll();
---
SELECT `prefixes`.*, `operateurs`.`nom` as `operateur_nom`
FROM `prefixes`
JOIN `operateurs` ON `operateurs`.`id` = `prefixes`.`operateur_id`
WHERE `operateurs`.`est_nous` = 0
ORDER BY `operateurs`.`nom` ASC, `prefixes`.`prefixe` ASC