app/Models/Operateur/TransactionModel.php

    public function getGainsParType(): array
    {
        return $this->db->table('transactions t')
            ->select('t.type_operation_id, to2.libelle, SUM(t.frais) AS total_frais, COUNT(*) AS nombre')
            ->join('types_operation to2', 'to2.id = t.type_operation_id', 'left')
            ->whereIn('t.type_operation_id', [2, 3])
            ->groupBy('t.type_operation_id')
            ->get()
            ->getResultArray();
---
SELECT `t`.`type_operation_id`, `to2`.`libelle`, SUM(t.frais) AS total_frais, COUNT(*) AS nombre
FROM `transactions` `t`
LEFT JOIN `types_operation` `to2` ON `to2`.`id` = `t`.`type_operation_id`
WHERE `t`.`type_operation_id` IN (2,3)
GROUP BY `t`.`type_operation_id`

    public function getGainsInternes(): array
    {
        return $this->db->table('transactions t')
            ->select('t.type_operation_id, to2.libelle, SUM(t.frais) AS total_frais, COUNT(*) AS nombre')
            ->join('types_operation to2', 'to2.id = t.type_operation_id', 'left')
            ->whereIn('t.type_operation_id', [2, 3])
            ->where('t.operateur_destinataire_id', null)
            ->groupBy('t.type_operation_id')
            ->get()
            ->getResultArray();
---
SELECT `t`.`type_operation_id`, `to2`.`libelle`, SUM(t.frais) AS total_frais, COUNT(*) AS nombre
FROM `transactions` `t`
LEFT JOIN `types_operation` `to2` ON `to2`.`id` = `t`.`type_operation_id`
WHERE `t`.`type_operation_id` IN (2,3)
AND `t`.`operateur_destinataire_id` IS NULL
GROUP BY `t`.`type_operation_id`

    public function getGainsExternes(): array
    {
        return $this->db->table('transactions t')
            ->select('op.nom AS operateur_nom, SUM(t.commission_externe) AS total_commission, COUNT(*) AS nombre')
            ->join('operateurs op', 'op.id = t.operateur_destinataire_id', 'left')
            ->where('t.type_operation_id', 3)
            ->where('t.operateur_destinataire_id IS NOT NULL', null, false)
            ->groupBy('t.operateur_destinataire_id')
            ->get()
            ->getResultArray();
---
SELECT `op`.`nom` AS `operateur_nom`, SUM(t.commission_externe) AS total_commission, COUNT(*) AS nombre
FROM `transactions` `t`
LEFT JOIN `operateurs` `op` ON `op`.`id` = `t`.`operateur_destinataire_id`
WHERE `t`.`type_operation_id` = 3
AND t.operateur_destinataire_id IS NOT NULL
GROUP BY `t`.`operateur_destinataire_id`

    public function getMontantsParOperateur(): array
    {
        return $this->db->table('transactions t')
            ->select('op.id AS operateur_id, op.nom AS operateur_nom, SUM(t.montant) AS montant_total, COUNT(*) AS nb_transferts')
            ->join('operateurs op', 'op.id = t.operateur_destinataire_id', 'left')
            ->where('t.type_operation_id', 3)
            ->where('t.operateur_destinataire_id IS NOT NULL', null, false)
            ->groupBy('t.operateur_destinataire_id')
            ->orderBy('montant_total', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `op`.`id` AS `operateur_id`, `op`.`nom` AS `operateur_nom`, SUM(t.montant) AS montant_total, COUNT(*) AS nb_transferts
FROM `transactions` `t`
LEFT JOIN `operateurs` `op` ON `op`.`id` = `t`.`operateur_destinataire_id`
WHERE `t`.`type_operation_id` = 3
AND t.operateur_destinataire_id IS NOT NULL
GROUP BY `t`.`operateur_destinataire_id`
ORDER BY `montant_total` DESC