app/Models/AdminModel.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function findByEmail(String $email){
        return $this->where('email', $email)->first();