app/Models/OperateurModel.php

    public function getNotreOperateur(): ?array
    {
        return $this->where('est_nous', 1)->first();
---
SELECT *
FROM `operateurs`
WHERE `est_nous` = 1
 LIMIT 1

    public function getNous(): ?array
    {
        return $this->where('est_nous', 1)->first();
---
SELECT *
FROM `operateurs`
WHERE `est_nous` = 0

    public function getOperateursExterne(): array
    {
        return $this->where('est_nous', 0)->findAll();
---
SELECT *
FROM `operateurs`
WHERE `est_nous` = 0