app/Models/PrefixesModel.php

SELECT COUNT(*) AS `numrows`
FROM `prefixes`
WHERE `prefixe` = '033'
---
    public function prefixeExiste(string $telephone): bool
    {
        $prefixe = substr($telephone, 0, 3);

        return $this->where('prefixe', $prefixe)->countAllResults() > 0;

SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
 LIMIT 1
SELECT *
FROM `operateurs`
WHERE `id` = 1
AND `est_nous` = 1
---
    public function prefixeEstANous(string $telephone): bool
    {
        $prefixe = substr($telephone, 0, 3);
        $row = $this->where('prefixe', $prefixe)->first();

        if (!$row || !isset($row['operateur_id'])) {
            return false;
        }

        $operateur = $this->db->table('operateurs')
            ->where('id', $row['operateur_id'])
            ->where('est_nous', 1)
            ->get()->getRowArray();

SELECT *
FROM `prefixes`
WHERE `prefixe` = '031'
 LIMIT 1
---
    public function getOperateurIdByTelephone(string $telephone): ?int
    {
        $prefixe = substr($telephone, 0, 3);
        $row = $this->where('prefixe', $prefixe)->first();