app/Models/TrancheMontantModel.php

    public function getFrais($typeOperationId, $montant)
    {
        $tranche = $this->where('type_operation_id', $typeOperationId)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->first();
---
SELECT *
FROM `tranche_montant`
WHERE `type_operation_id` = 1
AND `montant_min` <= 5000
AND `montant_max` >= 5000
 LIMIT 1